Pandas.Series

In [1]:
import pandas as pd

temp_series = pd.Series({
    'UK': 'Англия',
    'CA': 'Канада',
    'US' : 'США',
    'RU': 'Россия',
    'UA': 'Украина',
    'BY': 'Беларусь',
    'KZ': 'Казахстан'},
    name = 'countries'
)
display(temp_series)
print(temp_series.loc['KZ'])
print(temp_series.loc[['RU', 'UK']])
print(temp_series.iloc[1])
print(temp_series.iloc[1:5])

UK       Англия
CA       Канада
US          США
RU       Россия
UA      Украина
BY     Беларусь
KZ    Казахстан
Name: countries, dtype: object

Казахстан
RU    Россия
UK    Англия
Name: countries, dtype: object
Канада
CA     Канада
US        США
RU     Россия
UA    Украина
Name: countries, dtype: object

Dataframe

In [2]:
import pandas as pd
""" DataFrame является двумерной структурой и представляется в виде таблицы, в которой есть строки и столбцы:
столбцами в DataFrame выступают объекты Series, а строки формируются из их элементов.
Также в DataFrame есть метки (индексы), которые соответствуют каждой строке таблицы. """
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902],
    'boolean':[0, 0, 0, 0, 0, 0, 1]
}
)
display(countries_df)
#-------------------------------------------------------------------------------------------------------
countries_df_2 = pd.DataFrame(
    data = [
        ['Англия', 56.29, 133396], # column = data in Series
        ['Канада', 38.05, 9984670],
        ['США', 322.28, 9826630],
        ['Россия', 146.24, 17125191],
        ['Украина', 45.5, 603628],
        ['Беларусь', 9.5, 207600],
        ['Казахстан', 17.04, 2724902]
    ],
    columns= ['country', 'population', 'square'], # = name in Series
    index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ'] # = index in Series
)
display(countries_df_2)

     country  population    square  boolean
0     Англия       56.29    133396        0
1     Канада       38.05   9984670        0
2        США      322.28   9826630        0
3     Россия      146.24  17125191        0
4    Украина       45.50    603628        0
5   Беларусь        9.50    207600        0
6  Казахстан       17.04   2724902        1

      country  population    square
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

In [3]:
import pandas as pd
countries_df = pd.DataFrame(
    data = [
        ['Англия', 56.29, 133396], # column = data in Series
        ['Канада', 38.05, 9984670],
        ['США', 322.28, 9826630],
        ['Россия', 146.24, 17125191],
        ['Украина', 45.5, 603628],
        ['Беларусь', 9.5, 207600],
        ['Казахстан', 17.04, 2724902]
    ],
    columns= ['country', 'population', 'square'], # = name in Series
    index = ['UK', 'CA', 'US', 'RU', 'UA', 'BY', 'KZ'] # = index in Series
)
display(countries_df)
display(countries_df.population['US'])
display(countries_df['square'])

      country  population    square
UK     Англия       56.29    133396
CA     Канада       38.05   9984670
US        США      322.28   9826630
RU     Россия      146.24  17125191
UA    Украина       45.50    603628
BY   Беларусь        9.50    207600
KZ  Казахстан       17.04   2724902

322.28

UK      133396
CA     9984670
US     9826630
RU    17125191
UA      603628
BY      207600
KZ     2724902
Name: square, dtype: int64

In [4]:
#Write to csv
countries_df = pd.DataFrame({
    'country': ['Англия', 'Канада', 'США', 'Россия', 'Украина', 'Беларусь', 'Казахстан'],
    'population': [56.29, 38.05, 322.28, 146.24, 45.5, 9.5, 17.04],
    'square': [133396, 9984670, 9826630, 17125191, 603628, 207600, 2724902]
})

countries_df.to_csv('data/countries.csv', index=False, sep=';')

In [5]:
#Read from csv, web
some_data = pd.read_csv('data/countries.csv', sep=';')
#display(some_data)
some_data_2 = pd.read_csv('https://raw.githubusercontent.com/esabunor/MLWorkspace/master/melb_data.csv')
#display(some_data_2)
some_data_3 = pd.read_csv('data/melb_data.csv', sep=',')
display(some_data_3.loc[3521, 'Landsize'] / some_data_3.loc[1690, 'Landsize'])

2.7857142857142856

In [6]:
#Head \ Tail & all about DF
data = pd.read_csv('data/melb_data.csv', sep=',')
display(data.head(1))
display(data.tail(1))
display(data.shape)
display(data.info())

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
0,0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,...,1.0,202.0,126.0,1970.0,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0,"-37.7996, 144.9984"

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
13579,13579,Yarraville,6 Agnes St,4,h,1285000.0,SP,Village,26/08/2017,6.3,...,1.0,362.0,112.0,1920.0,NaN,-37.81188,144.88449,Western Metropolitan,6543.0,"-37.81188, 144.88449"

(13580, 23)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  float64
 12  Bathroom       13580 non-null  float64
 13  Car            13580 non-null  float64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  float64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  float64
 22  Coordinates    13580 non-null  object
dtypes: float64(11), int64(3), object(9)
memory usage: 2.4+ MB

None

In [7]:
# DType change
data = pd.read_csv('data/melb_data.csv', sep=',')
data['Car'] = data['Car'].astype('int64')
data['YearBuilt'] = data['YearBuilt'].astype('int64')
data['Bedroom'] = data['Bedroom'].astype('int64')
data['Bathroom'] = data['Bathroom'].astype('int64')
data['Propertycount'] = data['Propertycount'].astype('int64')

display(data.info())
#display(data.tail())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 23 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          13580 non-null  int64
 1   Suburb         13580 non-null  object
 2   Address        13580 non-null  object
 3   Rooms          13580 non-null  int64
 4   Type           13580 non-null  object
 5   Price          13580 non-null  float64
 6   Method         13580 non-null  object
 7   SellerG        13580 non-null  object
 8   Date           13580 non-null  object
 9   Distance       13580 non-null  float64
 10  Postcode       13580 non-null  int64
 11  Bedroom        13580 non-null  int64
 12  Bathroom       13580 non-null  int64
 13  Car            13580 non-null  int64
 14  Landsize       13580 non-null  float64
 15  BuildingArea   13580 non-null  float64
 16  YearBuilt      13580 non-null  int64
 17  CouncilArea    12211 non-null  object
 18  Lattitude      13580 non-null  float64
 19  Longtitude     13580 non-null  float64
 20  Regionname     13580 non-null  object
 21  Propertycount  13580 non-null  int64
 22  Coordinates    13580 non-null  object
dtypes: float64(6), int64(8), object(9)
memory usage: 2.4+ MB

None

DF.describe()

In [8]:
data = pd.read_csv('data/melb_data.csv', sep=',')
display(data.describe().loc[:,['Distance', 'BuildingArea' , 'Price']])
display(data.describe(include=['object']))

           Distance  BuildingArea         Price
count  13580.000000  13580.000000  1.358000e+04
mean      10.137776    139.633972  1.075684e+06
std        5.868725    392.217403  6.393107e+05
min        0.000000      0.000000  8.500000e+04
25%        6.100000    122.000000  6.500000e+05
50%        9.200000    126.000000  9.030000e+05
75%       13.000000    129.940000  1.330000e+06
max       48.100000  44515.000000  9.000000e+06

,Suburb,Address,Type,Method,SellerG,Date,CouncilArea,Regionname,Coordinates
count,13580,13580,13580,13580,13580,13580,12211,13580,13580
unique,314,13378,3,5,268,58,33,8,13097
top,Reservoir,36 Aberfeldie St,h,S,Nelson,27/05/2017,Moreland,Southern Metropolitan,"-37.8361, 144.9966"
freq,359,3,9449,9022,1565,473,1163,4695,12

In [9]:
data = pd.read_csv('data/melb_data.csv', sep=',')
display(data['Regionname'].value_counts(normalize=True))
display(data['Suburb'].value_counts(normalize=True))
display(data['SellerG'].value_counts(normalize=True))
display(data['Type'].value_counts(normalize=True))

Southern Metropolitan         0.345729
Northern Metropolitan         0.286451
Western Metropolitan          0.217084
Eastern Metropolitan          0.108321
South-Eastern Metropolitan    0.033137
Eastern Victoria              0.003903
Northern Victoria             0.003019
Western Victoria              0.002356
Name: Regionname, dtype: float64

Reservoir         0.026436
Richmond          0.019146
Bentleigh East    0.018336
Preston           0.017599
Brunswick         0.016348
                    ...
Sandhurst         0.000074
Bullengarook      0.000074
Croydon South     0.000074
Montrose          0.000074
Monbulk           0.000074
Name: Suburb, Length: 314, dtype: float64

Nelson           0.115243
Jellis           0.096907
hockingstuart    0.085935
Barry            0.074448
Ray              0.051620
                   ...
Prowse           0.000074
Luxe             0.000074
Zahn             0.000074
Homes            0.000074
Point            0.000074
Name: SellerG, Length: 268, dtype: float64

h    0.695803
u    0.222165
t    0.082032
Name: Type, dtype: float64

Aggregate

In [10]:
data = pd.read_csv('data/melb_data.csv', sep=',')
#display(data.mean())
display(int(data['YearBuilt'].mean()))
#display(data['Price'].mean(), data['Price'].min(), data['Price'].max())
display(data['Suburb'].mode())

1966

0    Reservoir
Name: Suburb, dtype: object

In [11]:
data = pd.read_csv('data/melb_data.csv', sep=',')
landsize_median = data['Landsize'].median() 
landsize_mean =  data['Landsize'].mean()
print(100 * abs(landsize_median - landsize_mean)/landsize_mean)
data['Propertycount'].max()
data['Distance'].std()
####
building_mean = data['BuildingArea'].mean()
building_median = data['BuildingArea'].median()
display(abs(building_mean - building_median)/building_mean)
data['Bedroom'].mode()

21.20571398354619

0.09764079662364533

0    3.0
Name: Bedroom, dtype: float64

```python
Data filtration
```

In [12]:
#Mask mech
data = pd.read_csv('data/melb_data.csv', sep=',')
mask = data['Price'] > 2000000
display(data[mask].tail(2))
############or
display(data[data['Price'] > 2000000].tail(2))

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
13555,13555,Surrey Hills,3 Oak St,4,h,3100000.0,VB,Marshall,26/08/2017,10.2,...,3.0,832.0,126.0,1970.0,NaN,-37.83564,145.10919,Southern Metropolitan,5457.0,"-37.83564, 145.10919"
13578,13578,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,...,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0,"-37.85908, 144.89299"

,index,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,Coordinates
13555,13555,Surrey Hills,3 Oak St,4,h,3100000.0,VB,Marshall,26/08/2017,10.2,...,3.0,832.0,126.0,1970.0,NaN,-37.83564,145.10919,Southern Metropolitan,5457.0,"-37.83564, 145.10919"
13578,13578,Williamstown,96 Verdon St,4,h,2500000.0,PI,Sweeney,26/08/2017,6.8,...,5.0,866.0,157.0,1920.0,NaN,-37.85908,144.89299,Western Metropolitan,6380.0,"-37.85908, 144.89299"

In [13]:
#Mask combinations
data = pd.read_csv('data/melb_data.csv', sep=',')
mask = (data['Price'] > 2000000) & (data['Rooms'] == 3)
display(data[mask].shape[0])
mean_price = data['Price'].mean()
#Median building area of objects that have price above mean:
data[data['Price'] > mean_price]['BuildingArea'].median()
data[data['Bathroom'] == 0].shape[0]
data[(data['SellerG'] == 'Nelson') & (data['Price'] > 3000000)].shape[0]
data[data['BuildingArea'] == 0]['Price'].min()
data[(data['Price'] < 1000000) & ((data['Rooms'] > 5)|(data['YearBuilt'] > 2015))]['Price'].mean()
data[(data['Price'] < 3000000) & (data['Type'] == 'h')]['Regionname'].mode()

271

0    Northern Metropolitan
Name: Regionname, dtype: object

10.13 DF - final test

In [14]:
stud_data = pd.read_csv('data/students_performance.csv', sep=',')
display(stud_data.info())
#display(stud_data.iloc[155])
#display(stud_data['math score'].mean())
#stud_data['race/ethnicity'].mode()
#stud_data[stud_data['test preparation course'] == 'completed']['reading score'].mean()
#stud_data[stud_data['math score'] == 0]
#display(stud_data[stud_data['lunch'] == 'free/reduced']['math score'].mean())
#display(stud_data[stud_data['lunch'] == 'standard']['math score'].mean())
stud_data['parental level of education'].value_counts(normalize=True)
median_A = stud_data[stud_data['race/ethnicity'] == 'group A']['writing score'].median()
mean_C = stud_data[stud_data['race/ethnicity'] == 'group C']['writing score'].mean()
display(round(abs(median_A - mean_C)))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

None

6

Feature Engineering

In [15]:
melb_data = pd.read_csv('data/melb_data_ps.csv', sep=',')
melb_df = melb_data.copy()
melb_df.drop(['index', 'Coordinates'], axis=1, inplace=True)
rooms = melb_df['Rooms'] + melb_df['Bedroom'] + melb_df['Bathroom']
display(rooms)
melb_df['MeanRoomsSquare'] = melb_df['BuildingArea'] / rooms
melb_df.head()

0         5
1         5
2         8
3         8
4         8
         ..
13575    10
13576     8
13577     8
13578     9
13579     9
Length: 13580, dtype: int64

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount,MeanRoomsSquare
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067,...,1,202.0,126.0,1970,Yarra,-37.7996,144.9984,Northern Metropolitan,4019,25.20
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067,...,0,156.0,79.0,1900,Yarra,-37.8079,144.9934,Northern Metropolitan,4019,15.80
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067,...,0,134.0,150.0,1900,Yarra,-37.8093,144.9944,Northern Metropolitan,4019,18.75
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067,...,1,94.0,126.0,1970,Yarra,-37.7969,144.9969,Northern Metropolitan,4019,15.75
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067,...,2,120.0,142.0,2014,Yarra,-37.8072,144.9941,Northern Metropolitan,4019,17.75

In [17]:
diff_area = melb_df['BuildingArea'] - melb_df['Landsize']
sum_area = melb_df['BuildingArea'] + melb_df['Landsize']
melb_df['AreaRatio'] = diff_area / sum_area
display(melb_df['AreaRatio'])

0       -0.231707
1       -0.327660
2        0.056338
3        0.145455
4        0.083969
           ...
13575   -0.676093
13576   -0.429185
13577   -0.551601
13578   -0.693060
13579   -0.527426
Name: AreaRatio, Length: 13580, dtype: float64

In [19]:
melb_df['Date'] = pd.to_datetime(melb_df['Date'], dayfirst=True)
melb_df['Date']

0       2016-12-03
1       2016-02-04
2       2017-03-04
3       2017-03-04
4       2016-06-04
           ...
13575   2017-08-26
13576   2017-08-26
13577   2017-08-26
13578   2017-08-26
13579   2017-08-26
Name: Date, Length: 13580, dtype: datetime64[ns]